<?php

return [
    'temp' => [
        ['max' => 0,  'text' => 'παγωμένο'],
        ['max' => 5,  'text' => 'κρύο'],
        ['max' => 12, 'text' => 'δροσερό'],
        ['max' => 18, 'text' => 'ήπιο'],
        ['max' => 25, 'text' => 'ζεστό'],
        ['max' => INF,'text' => 'πολύ ζεστό'],
    ],
    'wind' => [
        ['max' => 1.5,  'text' => 'ήρεμο έως ελαφρύ άνεμο'],
        ['max' => 5.5,  'text' => 'ελαφρύ αεράκι'],
        ['max' => 10.8, 'text' => 'μέτριο αεράκι'],
        ['max' => 17.2, 'text' => 'ισχυρό αεράκι'],
        ['max' => 24.5, 'text' => 'θυελλώδης άνεμος'],
        ['max' => INF,  'text' => 'άνεμος θύελλας'],
    ],
    'precip_prob' => [
        ['max' => 10,  'text' => 'πολύ απίθανο'],
        ['max' => 25,  'text' => 'μικρή πιθανότητα'],
        ['max' => 45,  'text' => 'πιθανότητα'],
        ['max' => 65,  'text' => 'πιθανό'],
        ['max' => 85,  'text' => 'πολύ πιθανό'],
        ['max' => INF, 'text' => 'σχεδόν βέβαιο'],
    ],
    'sky' => [
        ['max' => 10,  'text' => 'καθαρός ουρανός'],
        ['max' => 35,  'text' => 'κυρίως ηλιόλουστο'],
        ['max' => 70,  'text' => 'μερικώς συννεφιασμένο'],
        ['max' => 90,  'text' => 'κυρίως συννεφιασμένο'],
        ['max' => INF, 'text' => 'συννεφιασμένο'],
    ],
    'precip_mm' => [
        ['max' => 0.1, 'text' => 'ξηρό'],
        ['max' => 1.0, 'text' => 'ελαφρύ'],
        ['max' => 5.0, 'text' => 'μέτριο'],
        ['max' => INF, 'text' => 'ισχυρό'],
    ],
];
