<?php

return [
    'temp' => [
        ['max' => 0,  'text' => 'ледено'],
        ['max' => 5,  'text' => 'хладно'],
        ['max' => 12, 'text' => 'свеже'],
        ['max' => 18, 'text' => 'благо'],
        ['max' => 25, 'text' => 'топло'],
        ['max' => INF,'text' => 'врло топло'],
    ],
    'wind' => [
        ['max' => 1.5,  'text' => 'тихо до лаганог ветра'],
        ['max' => 5.5,  'text' => 'слаб поветрац'],
        ['max' => 10.8, 'text' => 'умерен поветрац'],
        ['max' => 17.2, 'text' => 'јак поветрац'],
        ['max' => 24.5, 'text' => 'олујни ветар'],
        ['max' => INF,  'text' => 'ветар олујне снаге'],
    ],
    'precip_prob' => [
        ['max' => 10,  'text' => 'врло мало вероватно'],
        ['max' => 25,  'text' => 'мала шанса'],
        ['max' => 45,  'text' => 'шанса'],
        ['max' => 65,  'text' => 'вероватно'],
        ['max' => 85,  'text' => 'врло вероватно'],
        ['max' => INF, 'text' => 'готово сигурно'],
    ],
    'sky' => [
        ['max' => 10,  'text' => 'ведро небо'],
        ['max' => 35,  'text' => 'углавном сунчано'],
        ['max' => 70,  'text' => 'делимично облачно'],
        ['max' => 90,  'text' => 'углавном облачно'],
        ['max' => INF, 'text' => 'облачно'],
    ],
    'precip_mm' => [
        ['max' => 0.1, 'text' => 'суво'],
        ['max' => 1.0, 'text' => 'слабо'],
        ['max' => 5.0, 'text' => 'умерено'],
        ['max' => INF, 'text' => 'јако'],
    ],
];
